# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

a = int(input('Введи трехзначное целое число '))
if a < 0: a = -a
sum = a % 10 + int((a / 10) % 10) + int((a / 100) % 10)
print(f'Сумма цифр трехзначного числа {a} равна {sum}')

